# Triton model config for ResNet-50
# Lives at: cloudrun/model_repository/resnet50/config.pbtxt

name: "resnet50"
platform: "onnxruntime_onnx"
max_batch_size: 0

input [
  {
    name: "input"
    data_type: TYPE_FP32
    dims: [ 1, 3, 224, 224 ]
  }
]

output [
  {
    name: "output"
    data_type: TYPE_FP32
    dims: [ 1, 1000 ]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_AUTO
  }
]